[
  {
    "id": "research1",
    "title": "AI for Materials Design",
    "description": "We develop and apply artificial intelligence technologies to accelerate materials design and discovery.",
    "image": "/images/research/design.jpg",
    "details": [
      "Deep-learning–based prediction of material properties",
      "Generative models for novel material design",
      "Optimization of material structures using AI-driven simulations"
    ]
  },
  {
    "id": "research2",
    "title": "AI-Based Materials Analysis and Evaluation",
    "description": "We utilize artificial intelligence to analyze, evaluate, and predict the properties and performance of various materials.",
    "image": "/images/research/ssl.png",
    "details": [
      "AI-driven characterization of material microstructures",
      "Automated analysis of experimental and simulation data",
      "Performance prediction and reliability assessment using machine learning models"
    ]
  },
  {
    "id": "research3",
    "title": "Physics-Informed AI for Materials Process Prediction",
    "description": "We apply physics-informed artificial intelligence models to predict, simulate, and optimize materials processing behaviors with high accuracy and reliability.",
    "image": "/images/research/pgnn.png",
    "details": [
      "Development of physics-informed machine learning models for process prediction",
      "Hybrid AI–simulation frameworks for modeling complex processing phenomena",
      "Improvement of process accuracy through integration of physical constraints and real data"
    ]
  },
  {
    "id": "research4",
    "title": "Materials-Specialized VLMs and AI Agents",
    "description": "We develop vision-language models and AI agents tailored for materials science to enhance analysis, automation, and decision-making in research workflows.",
    "image": "/images/research/agent.png",
    "details": [
      "Development of materials-focused vision-language models for image and text understanding",
      "AI agents for automating experimental planning and research workflows",
      "Integration of multimodal AI systems for advanced materials analysis and discovery"
    ]
  },
  {
    "id": "research5",
    "title": "Autonomous Laboratory for Metallic Materials",
    "description": "We build autonomous experimental platforms for metallic materials, integrating robotics and AI to accelerate materials discovery and optimization.",
    "image": "/images/research/sdl.png",
    "details": [
      "Robotics-assisted synthesis and processing of metallic materials",
      "AI-guided experimental planning and optimization",
      "Automated characterization and data-driven feedback loops"
    ]
  }
]